export default function NewsLetter() {
  return (
    <div className="bg-[#F8F8F8] p-5 flex flex-col lg:flex-row justify-center gap-6 items-start lg:items-end">
      <div className="flex flex-col sm:flex-row justify-center items-start sm:items-center gap-4">
        <svg
          width="64"
          height="64"
          viewBox="0 0 64 64"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <rect width="64" height="64" rx="32" fill="#F4EBDE" />
          <path
            d="M42.866 43.7765H21.1343C19.8338 43.7748 18.587 43.2573 17.6674 42.3376C16.7479 41.4179 16.2306 40.171 16.2292 38.8704V25.1278C16.2306 23.8273 16.7479 22.5805 17.6675 21.6609C18.587 20.7414 19.8338 20.2241 21.1343 20.2227H42.866C44.1665 20.2241 45.4134 20.7413 46.3331 21.6609C47.2529 22.5804 47.7703 23.8272 47.772 25.1278V38.8704C47.7706 40.1712 47.2532 41.4182 46.3335 42.3379C45.4137 43.2577 44.1667 43.775 42.866 43.7765ZM21.1343 22.5084C20.4398 22.5091 19.774 22.7853 19.2829 23.2764C18.7918 23.7675 18.5156 24.4333 18.5149 25.1278V38.8704C18.5154 39.5651 18.7915 40.2312 19.2826 40.7224C19.7737 41.2137 20.4397 41.49 21.1343 41.4908H42.866C43.5607 41.49 44.2268 41.2137 44.718 40.7225C45.2093 40.2312 45.4856 39.5652 45.4863 38.8704V25.1278C45.4853 24.4332 45.2089 23.7674 44.7177 23.2763C44.2265 22.7853 43.5605 22.5091 42.866 22.5084H21.1343Z"
            fill="#B47720"
          />
          <path
            d="M31.9863 35.0763C31.0274 35.0858 30.0933 34.7717 29.3349 34.1849L17.1127 24.445C16.8757 24.256 16.7234 23.9806 16.6895 23.6793C16.6555 23.378 16.7427 23.0756 16.9317 22.8386C17.1207 22.6016 17.3961 22.4493 17.6974 22.4154C17.9986 22.3814 18.301 22.4686 18.5381 22.6576L30.7566 32.3975C31.1175 32.6535 31.5494 32.7905 31.9919 32.7893C32.4344 32.7882 32.8655 32.6489 33.2252 32.3911L45.2928 22.6622C45.5286 22.4719 45.8304 22.3832 46.1316 22.4154C46.4329 22.4476 46.709 22.5982 46.8992 22.834C47.0894 23.0699 47.1782 23.3716 47.146 23.6728C47.1137 23.9741 46.9631 24.2502 46.7273 24.4404L34.6633 34.1693C33.8997 34.7665 32.9557 35.0863 31.9863 35.0763Z"
            fill="#B47720"
          />
        </svg>
        <div>
          <h2 className="text-lg text-[#333333]">
            الاشتراك فى النشرة البريدية
          </h2>
          <h3 className="text-sm text-[#666666]">
            انضم الآن واحصل على خصم 10٪ على مشترياتك التالية!
          </h3>
        </div>
      </div>
      <div className="flex flex-col gap-2 w-full max-w-xl">
        <h3 className="text-sm text-[#333333]">
          يمكنك إلغاء الاشتراك في أي لحظة
        </h3>
        <input
          type="email"
          className="rounded-md border border-[#EEE] bg-white outline-0 w-full py-3 px-2"
          placeholder="ادخل البريد الالكترونى"
        />
      </div>
      <button className="text-white bg-[#B47720] rounded-md px-6 py-3 w-full sm:w-auto">
        إشتراك
      </button>
    </div>
  );
}
